src/cf/InformationRegisters/БанкиАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БанкиАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияАУСНПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает идентификатор банка для обмена с сервисом АУСН
//
// Параметры:
//  БИК - строка
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторБанка(БИК) Экспорт
	
	БанкПоКлассификатору = РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
	Возврат РегистрыСведений.БанкиАУСН.Идентификатор(БанкПоКлассификатору);
	
КонецФункции

// Возвращает идентификатор банка
// 
// Параметры:
//  Банк - СправочникСсылка.КлассификаторБанков
// 
// Возвращаемое значение:
//   Строка
//
Функция ИдентификаторБанкаПоКлассификатору(Банк) Экспорт
	
	Идентификатор = РегистрыСведений.БанкиАУСН.Идентификатор(Банк);
	Если Идентификатор = Неопределено Тогда
		ИнтеграцияАУСН.ЗаписатьОшибкуВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Не определен идентификатор банка %1'"), Банк));
	КонецЕсли;
	
	Возврат ?(Идентификатор <> Неопределено, Идентификатор, "");
	
КонецФункции

// Возвращает ссылку на личный кабинет банка
// 
// Параметры:
//  Банк - СправочникСсылка.КлассификаторБанков
// 
// Возвращаемое значение:
//   Строка
//
Функция СсылкаЛичныйКабинетБанка(Банк) Экспорт
	
	СсылкаЛичныйКабинет = РегистрыСведений.БанкиАУСН.СсылкаЛичныйКабинет(Банк);
	Если СсылкаЛичныйКабинет = Неопределено Тогда
		ИнтеграцияАУСН.ЗаписатьОшибкуВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Не определена ссылка на личный кабинет банка %1'"), Банк));
	КонецЕсли;
	
	Возврат ?(СсылкаЛичныйКабинет <> Неопределено, СсылкаЛичныйКабинет, "");
	
КонецФункции

#КонецОбласти
